# Πρώτο Εργαστήριο - ΜΕΜ205 Περιγραφική Στατιστική

## 1. Jupyter Notebook
Το Jupyter Notebook είναι μια εφαρμογή ανοικτού κώδικα που μας επιτρέπει να δημιουργούμε και να μοιράζομαστε έγγραφα που περιέχουν κώδικα, μαθηματικές εξισώσεις, γραφήματα και κείμενα. 



###  Γνωριμία με το jupyter notebook

#### Jupyter Modes
- Command Mode
- Edit Mode
  - Markdown
  - Code

#### Hello Jupyter Notebook - Markdown (latex)
  
$$ \sum_{i=1}^N x_i$$
  
https://www.overleaf.com/learn/latex/Learn_LaTeX_in_30_minutes
  
#### Hello Jupyter Notebook - Python
1. Γράφουμε κωδικά **Python** (μία ή περισσότερες γραμμές).
2. Εκτελούμε τον κώδικα με **Shift + Enter**.

# title 
this is a line. 
$$E= mc^2$$

In [1]:
print("Hello, Jupyter Notebook!")

Hello, Jupyter Notebook!

## 2. Εισαγωγή στο Pandas

In [3]:
import pandas as pd
!pip install pandas

Requirement already satisfied: pandas in /home/kesmarag/.venvs/env3/lib64/python3.7/site-packages (1.3.4)
Requirement already satisfied: python-dateutil>=2.7.3 in /home/kesmarag/.venvs/env3/lib/python3.7/site-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.3 in /home/kesmarag/.venvs/env3/lib/python3.7/site-packages (from pandas) (2021.1)
Requirement already satisfied: numpy>=1.17.3 in /home/kesmarag/.venvs/env3/lib64/python3.7/site-packages (from pandas) (1.19.5)
Requirement already satisfied: six>=1.5 in /home/kesmarag/.venvs/env3/lib/python3.7/site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
WARNING: You are using pip version 21.2.1; however, version 23.0.1 is available.
You should consider upgrading via the '/home/kesmarag/.venvs/env3/bin/python -m pip install --upgrade pip' command.

### 2.1. DataFrame

In [4]:
data_1 = {
 'name': ['Nick', 'Helen', 'Steve', 'Mary', 'George'],
 'age': [20, 19, 22, 21, 20],
 'field': ['Mathematics', 'Physics', 'Literature', 'Mathematics', 'Chemistry'],
 'os': ['Windows', 'Windows', 'Windows', 'Linux', 'MacOS']
}

In [5]:
data_1

{'name': ['Nick', 'Helen', 'Steve', 'Mary', 'George'],
 'age': [20, 19, 22, 21, 20],
 'field': ['Mathematics', 'Physics', 'Literature', 'Mathematics', 'Chemistry'],
 'os': ['Windows', 'Windows', 'Windows', 'Linux', 'MacOS']}

In [6]:
dataset_1 = pd.DataFrame(data_1)

In [7]:
dataset_1

     name  age        field       os
0    Nick   20  Mathematics  Windows
1   Helen   19      Physics  Windows
2   Steve   22   Literature  Windows
3    Mary   21  Mathematics    Linux
4  George   20    Chemistry    MacOS

In [8]:
dataset_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   age     5 non-null      int64
 2   field   5 non-null      object
 3   os      5 non-null      object
dtypes: int64(1), object(3)
memory usage: 288.0+ bytes

In [10]:
data_2 = \
[
 ['Nick', 20, 'Mathematics', 'Windows'],
 ['Helen', 19, 'Physics', 'Windows'],
 ['Steve', 22, 'Literature', 'Windows'],
 ['Mary', 21, 'Mathematics', 'Linux'],
 ['George', 20, 'Chemistry', 'MacOS']
]

In [11]:
dataset_2a = pd.DataFrame(data_2)

In [12]:
dataset_2a

        0   1            2        3
0    Nick  20  Mathematics  Windows
1   Helen  19      Physics  Windows
2   Steve  22   Literature  Windows
3    Mary  21  Mathematics    Linux
4  George  20    Chemistry    MacOS

In [13]:
var_names = ["name", 'age', 'field', 'os']

In [14]:
dataset_2b = pd.DataFrame(data_2, columns=var_names)

In [15]:
dataset_2b

     name  age        field       os
0    Nick   20  Mathematics  Windows
1   Helen   19      Physics  Windows
2   Steve   22   Literature  Windows
3    Mary   21  Mathematics    Linux
4  George   20    Chemistry    MacOS

#### DataFrame και αρχεία .csv

1. Δημιουργούμε το αρχείο students.csv με έναν editor.
2. Γράφουμε το έξης περιεχόμενο και κάνουμε save.

```
name,age,field_of_stydy,os
Nick,20,Mathematics,Windows
Helen,19,Physics,Windows
Steve,22,Literature,Windows
Mary,21,Mathematics,Linux
George,20,Chemistry,MacOS
```

In [16]:
dataset_3a = pd.read_csv('students.csv')

In [17]:
dataset_3a

     name  age        field       os
0    Nick   20  Mathematics  Windows
1   Helen   19      Physics  Windows
2   Steve   22   Literature  Windows
3    Mary   21  Mathematics    Linux
4  George   20    Chemistry    MacOS

In [20]:
dataset_3a.index.values

array([0, 1, 2, 3, 4])

In [22]:
dataset_3a.loc[1]

name       Helen
age           19
field    Physics
os       Windows
Name: 1, dtype: object

In [23]:
dataset_3a.iloc[0]

name            Nick
age               20
field    Mathematics
os           Windows
Name: 0, dtype: object

In [24]:
dataset_3b = dataset_3a.set_index('name')

In [25]:
dataset_3b

        age        field       os
name
Nick     20  Mathematics  Windows
Helen    19      Physics  Windows
Steve    22   Literature  Windows
Mary     21  Mathematics    Linux
George   20    Chemistry    MacOS

In [26]:
dataset_3b.index.values

array(['Nick', 'Helen', 'Steve', 'Mary', 'George'], dtype=object)

In [27]:
dataset_3b.loc['Nick']

age               20
field    Mathematics
os           Windows
Name: Nick, dtype: object

In [28]:
dataset_3b.iloc[1]

age           19
field    Physics
os       Windows
Name: Helen, dtype: object

In [44]:
dataset_3c = pd.read_csv('./students.csv', index_col='name')

In [43]:
dataset_3c

       name        field       os
age
20     Nick  Mathematics  Windows
19    Helen      Physics  Windows
22    Steve   Literature  Windows
21     Mary  Mathematics    Linux
20   George    Chemistry    MacOS

In [36]:
dataset_3d = dataset_3c.drop('os', axis=1)

In [37]:
dataset_3d

        age        field
name
Nick     20  Mathematics
Helen    19      Physics
Steve    22   Literature
Mary     21  Mathematics
George   20    Chemistry

In [38]:
dataset_3e = dataset_3c.drop('Nick')

In [39]:
dataset_3e

        age        field       os
name
Helen    19      Physics  Windows
Steve    22   Literature  Windows
Mary     21  Mathematics    Linux
George   20    Chemistry    MacOS